// 간단한 문장 분류 for Node.js

// 모듈 로드
var bayes = require('bayes');
var Mecab = require('./mecab-mod.js');
var mecab = new Mecab();

// 샘플 텍스트
var t_jang = '장영실은 조선 전기의 관료이며 과학자, 기술자, 발명가이다. 경상남도 동래군 출생. 본관은 아산. 시조 장서의 9대손으로 추정된다.장영실은 동래현 관청에서 일하는 노비가 되었으며, 발명가인 장영실의 훌륭한 재주를 태종이 인정하여 발탁하였다. 세종대왕은 발명가라는 적성을 중요하게 생각하는 실용주의자였다. 세종은 장영실을 1421년 윤사웅, 최천구 등과 함께 중국에 보내어 천문기기의 모양을 배워오도록 했다. 귀국 후 장영실 나이 약 34세 때인 1423년에 천문기기를 제작한 공을 인정받아 면천되었고 다시 대신들의 의논을 거쳐 상의원 별좌에 임명되었다.그 후, 세종 대왕의 명에 따라 1432년부터 1438년까지 이천의 책임하에 천문 기구 제작 프로젝트에 참여했다. 그 과정에 수력에 의해 자동으로 작동되는 물시계인 자격루와 옥루를 만들어 세종으로부터 총애를 받았다. 이때 제작된 옥루는 해가 뜨고 지는 모습을 모형으로 만들어 시간, 계절을 알 수 있고 천체의 시간, 움직임도 관측할 수 있는 장치로 흠경각을 새로 지어 그 안에 설치했다. 이때 만들어진 천문 기구에는 천문 관측을 위한 기본 기기인 대간의, 소간의를 비롯하여 휴대용 해시계인 현주일구, 천평일구, 방향을 가리키는 정남일구, 혜정교와 종묘 앞에도 설치한 공중시계인 앙부일구, 밤낮으로 시간을 알리는 일성정시의, 규표 등이 있다. 이러한 공으로 1433년에는 호군의 관직을 더하였다.1434년에는 이천이 총책임자였던, 구리로 만든 금속활자인 갑인자의 주조에 참여하였다. 갑인자는 약 20여만 자에 달하며 하루에 40여 장을 찍을 수 있었다.장영실은 당시 세종대왕이 직접 재능이 뛰어나다고 극찬하였고, 수많은 기기를 제작하였다. 미천한 신분에서 승진을 거듭하여 종3품관 대호군에서 정3품관 상호군이라는 관직까지 이르렀다. 장영실은 이순지와 이천 등과 함께 조선 전기 당대의 훌륭한 최고의 과학자로 지금도 평가되고 있다.';

var t_lee = '이순신은 조선 중기의 무신이다. 본관은 덕수, 자는 여해, 시호는 충무이며, 한성 출신이다. 문반 가문 출신으로 1576년 무과에 급제하여 그 관직이 동구비보 권관, 훈련원 봉사, 발포진 수군만호, 조산보 만호, 전라좌도 수군절도사를 거쳐 정헌대부 삼도수군통제사에 이르렀다.본인 스스로에게 엄격하고 청렴한 생활을 하고 깊은 효심을 지닌 선비의 모범으로 평가된다. 장수로서는 임진왜란 때 조선의 삼도수군통제사가 되어 부하들을 통솔하는 지도력, 뛰어난 지략, 그리고 탁월한 전략과 능수능란한 전술로 일본 수군과의 해전에서 연전연승하여 나라를 구한 성웅으로 추앙받고 있다. 노량 해전에서 전사한 뒤 선무공신 1등관에 추록되고 증 의정부우의정에 추증되고 덕풍군에 추봉되었다가, 광해군 때 다시 증 의정부좌의정에 추증되고 덕풍부원군에 추봉되었고, 정조 때에는 증 의정부영의정으로 가증되었다.고려 때 정5품 중랑장을 지낸 덕수 이씨의 시조 이돈수의 12대손이며, 조선 초 영중추부사를 지낸 이변의 후손이다. 외가는 초계 변씨, 처가는 온양 방씨이다. 그의 묘는 충청남도 아산시에 있다.1592년 5월 23일에 고니시 유키나가가 이끌던 왜군 함대 700척이 오후 5시경 부산포를 침략하여 임진왜란이 발발하였다. 당시 선봉군의 병력은 약 16만명이었다. 이순신의 전라좌수영에 일본군의 침략이 알려진 때는 원균의 파발이 도착한 5월 26일 밤 10시였다. 이순신은 그 즉시 조정에 장계를 올렸고 아울러 경상, 전라, 충청도에도 왜의 침략을 알리는 파발을 보냈다. 그 뒤 이순신은 휘하의 병력 700여명을 비상 소집하여 방비를 갖추도록 하였다. 이 과정에서 이순신은 도주를 시도한 군졸 황옥현을 참수했다. 전열을 정비한 전라좌수영 소속 함대는 6월 8일까지 수영 앞바다에 총집결하도록 명령이 내려진 상태였다. 그러나 왜군의 함선은 이미 전라좌도 앞바다에 도달하고 있었다. 다음날 9일에 이순신은 전라우도 수군이 도착하면 전투를 벌이겠다는 장계를 조정에 올렸다.옥포해전은 이순신이 첫 승전을 알리게 된 해전이다. 6월 16일 정오 옥포항에서 정박하여 옥포에 침략했던 왜군을 공격하여 모두 26척을 침몰시켰으며, 잡혀있던 포로들을 구해내었다. 같은 날 오후에는 웅천현의 합포 앞바다에서 큰 배 한 척을 만나 이 또한 격파하였다. 전투는 17일에도 계속되었으며, 적진포에서 왜선 13척을 침몰시켰으나, 전세가 불리하여 육지로 도망간 적들을 쫓지는 못하였다. 이때 조선 조정은 이미 한양에서 철수하여 평안도로 후퇴하고 있었다. 27일에는 도원수 김명원이 임진강 방어에 실패하여 조선반도의 대부분은 왜군에 의하여 유린되고 있었다.'

// 텍스트 분할방법을 설정 ---- (※1)
var classifier = bayes({
    tokenizer: function (text) { return mecab.parse(text); }
});

// 텍스트 학습  --- (※2)
classifier.learn(t_jang, '장영실');
classifier.learn(t_lee, '이순신');

// 카테고리 판정 --- (※3)
categorize('임진왜란의 장군으로 조선의 무신');
categorize('조선 최고의 과학자');
categorize('자격루를 만든 사람');

// 카테고리 분류 결과를 출력 ---- (※4)
function categorize(text) {
  var r = classifier.categorize(text);
  console.log("카테고리=[" + r + "] - " + text);
}